{
  "v1.0": {
    "changelog": "- First Prominence version!"
  },
  "v1.3": {
    "changelog": "Prominence [FABRIC] 1.19.2 v1.3\r\nThis update adds some clientside changes, along with some quests, the highly requested Create addons and custom recipes for the Bedrock armor and tools!\r\n\r\nMods:\r\n- Added Server Browser (By Thethonk)\r\n- Added Create: Steam \u0027n\u0027 Rails (By mattentosh)\r\n- Added Create Crafts \u0026 Additions (By MRHminer)\r\n\r\n- Removed Forgotten Graves (Not needed due to Charm)\r\n- Updated All Mods\r\n\r\nConfigs \u0026 Quests:\r\n- Added custom crafting recipes for the Bedrock set, so people don\u0027t have to go through Spectrum to get the currently best armor set.\r\n- Configured BHMenu and Server Browser\r\n- Added Discord button in Esc Menu\r\n- Added Issues button in Esc Menu\r\n- Changed loading screen menu background\r\n- Other small menu changes\r\n- Modified some quests, harder ones now give powerful enchantments as rewards\r\n- Added new quests the \"Getting Started\" chapter\r\n- Added new quests the \"Paradise Lost\" chapter\r\n- Added custom window and taskbar icons"
  },
  "v1.4": {
    "changelog": "Prominence [FABRIC] v1.4 Update - Performance \u0026 Tech Quests\r\n\r\nThis update brings new performance improvements, lesser load times and ram usage, new quest chapters for Ad Astra and AE2 quests made by Juliet!\r\nOver 100 new quests in total! Tech Reborn and Create quests will come soon!\r\n\r\nMods:\r\n- Added Hexal (By Talia)\r\n- Added Connectivity (By someaddon)\r\n- Added Modpack Update Checker (By Jab125)\r\n- Added ModernFix (By embeddedt)\r\n- Updated all mods\r\n\r\nChanges:\r\n- Added three new quest chapters with over 100 quests: \"The Moon\", \"Ad Astra\" and \"AE2\"\r\n- Loading times improved a lot thanks to ModernFix\r\n- Improved chunk load performance, that some players had issues with\r\n- Cached structures to improve loading times\r\n- Fixed some quests rewards.\r\n- Balanced Frostiful\u0027s temperature.\r\n- Balanced Spellblade, Wizards and Priest\u0026Paladins loot pool.\r\n- Fixed Combat Roll icon\r\n- Fixed keybinds related to backpacks\r\n- Fixed some resource packs not being enabled by default for some people"
  },
  "v1.5": {
    "changelog": "Prominence [FABRIC] 1.19.2 v1.5\r\nThis update brings almost 1gb less ram usage, two new quest chapters and added rewards to some quests! Along with some balancing fixes and a new built-in shaderpack!\r\n\r\nThis update also comes with CameraOverhaul, which makes the camera also rotate when moving (Similar how modern games do it), if you feel motion sickness or simply don\u0027t like it, disable the mod via the Mods button.\r\n\r\nMods:\r\n- Added CameraOverhaul (By Mirsario)\r\n- Removed Inventory Tabs (Caused lots of issues)\r\n- Removed Inmis (Already have traveler\u0027s backpacks)\r\n- Updated all mods\r\n\r\nChanges:\r\n- Added Spirit quest chapter (by ブネックス#3722)\r\n- Added rewards to AE2 quest chapter (by Juliet#0076)\r\n- Added Simply Swords quest chapter (by Juliet#0076)\r\n- RAM Usage decreased ~800mb, it was caused by a bug from diagonal fences\r\n- CameraOverhaul comes configured to be effective mostly in 3rd person\r\n- Fixed some quests rewards and names\r\n- Balanced PlayerEX leveling, now XP being the only way to level up\r\n- Added Rethinking Voxels as a built-in shaderpack\r\n- Added mod menu button in the main menu"
  },
  "v1.6": {
    "changelog": "Prominence [FABRIC] v1.6\r\nThis update brings many changes and fixes to balance, loot tables and more. Along with a huge performance improvement in servers, and over 200 new quests contributed by our amazing community :heart:\r\n\r\nMods:\r\n- Added Zenith (By safrodev)\r\n- Added Befixment (By TheWinABagel)\r\n- Added MVS - Moog\u0027s Voyager Structures (By finndog_123)\r\n- Added Inventory Sorter (By cpw)\r\n- Added Cosmetic Armor [FABRIC] (By apace100)\r\n- Added Illagers Love Armor (By itsmineblock11)\r\n- Removed End Goblin Traders\r\n- Removed Fabric: Seasons (Caused too much lag on server)\r\n- Removed Fabric: Seasons Extras (Caused too much lag on server)\r\n- Removed Fabric: Seasons Croptopia Compat (Caused too much lag on server)\r\n- Updated all mods\r\n\r\nChanges:\r\n- Over 200 new quests, with 4 new chapters covering 6 mods.\r\n- Added Wizards and Spellblade Quests contributed by Forg#9458 and ブネックス#3722\r\n- Added Botania Quests contributed by ブネックス#3722\r\n- Added Spectrum Quests contributed by ブネックス#3722\r\n- Added Powah Quests contributed by ブネックス#3722\r\n- Added Archon Quests contributed by ブネックス#3722\r\n- CameraOverhaul now comes disabled by default\r\n- Added damage limits to prevent one-shot exploits (Disabled for now)\r\n- Big balance changes in items and loot tables\r\n- Removed per-player difficulty scaling, that was making it impossible to play in servers with a large playerbase\r\n- Removed various items for balance reasons\r\n- Now Bad Omen can be removed by drinking milk"
  }
}