{
  "v1.0": {
    "changelog": "- First Prominence version!"
  },
  "v1.3": {
    "changelog": "Prominence [FABRIC] 1.19.2 v1.3\r\nThis update adds some clientside changes, along with some quests, the highly requested Create addons and custom recipes for the Bedrock armor and tools!\r\n\r\nMods:\r\n- Added Server Browser (By Thethonk)\r\n- Added Create: Steam \u0027n\u0027 Rails (By mattentosh)\r\n- Added Create Crafts \u0026 Additions (By MRHminer)\r\n\r\n- Removed Forgotten Graves (Not needed due to Charm)\r\n- Updated All Mods\r\n\r\nConfigs \u0026 Quests:\r\n- Added custom crafting recipes for the Bedrock set, so people don\u0027t have to go through Spectrum to get the currently best armor set.\r\n- Configured BHMenu and Server Browser\r\n- Added Discord button in Esc Menu\r\n- Added Issues button in Esc Menu\r\n- Changed loading screen menu background\r\n- Other small menu changes\r\n- Modified some quests, harder ones now give powerful enchantments as rewards\r\n- Added new quests the \"Getting Started\" chapter\r\n- Added new quests the \"Paradise Lost\" chapter\r\n- Added custom window and taskbar icons"
  },
  "v1.4": {
    "changelog": "Prominence [FABRIC] v1.4 Update - Performance \u0026 Tech Quests\r\n\r\nThis update brings new performance improvements, lesser load times and ram usage, new quest chapters for Ad Astra and AE2 quests made by Juliet!\r\nOver 100 new quests in total! Tech Reborn and Create quests will come soon!\r\n\r\nMods:\r\n- Added Hexal (By Talia)\r\n- Added Connectivity (By someaddon)\r\n- Added Modpack Update Checker (By Jab125)\r\n- Added ModernFix (By embeddedt)\r\n- Updated all mods\r\n\r\nChanges:\r\n- Added three new quest chapters with over 100 quests: \"The Moon\", \"Ad Astra\" and \"AE2\"\r\n- Loading times improved a lot thanks to ModernFix\r\n- Improved chunk load performance, that some players had issues with\r\n- Cached structures to improve loading times\r\n- Fixed some quests rewards.\r\n- Balanced Frostiful\u0027s temperature.\r\n- Balanced Spellblade, Wizards and Priest\u0026Paladins loot pool.\r\n- Fixed Combat Roll icon\r\n- Fixed keybinds related to backpacks\r\n- Fixed some resource packs not being enabled by default for some people"
  },
  "v1.5": {
    "changelog": "Prominence [FABRIC] 1.19.2 v1.5\r\nThis update brings almost 1gb less ram usage, two new quest chapters and added rewards to some quests! Along with some balancing fixes and a new built-in shaderpack!\r\n\r\nThis update also comes with CameraOverhaul, which makes the camera also rotate when moving (Similar how modern games do it), if you feel motion sickness or simply don\u0027t like it, disable the mod via the Mods button.\r\n\r\nMods:\r\n- Added CameraOverhaul (By Mirsario)\r\n- Removed Inventory Tabs (Caused lots of issues)\r\n- Removed Inmis (Already have traveler\u0027s backpacks)\r\n- Updated all mods\r\n\r\nChanges:\r\n- Added Spirit quest chapter (by ブネックス#3722)\r\n- Added rewards to AE2 quest chapter (by Juliet#0076)\r\n- Added Simply Swords quest chapter (by Juliet#0076)\r\n- RAM Usage decreased ~800mb, it was caused by a bug from diagonal fences\r\n- CameraOverhaul comes configured to be effective mostly in 3rd person\r\n- Fixed some quests rewards and names\r\n- Balanced PlayerEX leveling, now XP being the only way to level up\r\n- Added Rethinking Voxels as a built-in shaderpack\r\n- Added mod menu button in the main menu"
  },
  "v1.6": {
    "changelog": "Prominence [FABRIC] v1.6\r\nThis update brings many changes and fixes to balance, loot tables and more. Along with a huge performance improvement in servers, and over 200 new quests contributed by our amazing community :heart:\r\n\r\nMods:\r\n- Added Zenith (By safrodev)\r\n- Added Befixment (By TheWinABagel)\r\n- Added MVS - Moog\u0027s Voyager Structures (By finndog_123)\r\n- Added Inventory Sorter (By cpw)\r\n- Added Cosmetic Armor [FABRIC] (By apace100)\r\n- Added Illagers Love Armor (By itsmineblock11)\r\n- Removed End Goblin Traders\r\n- Removed Fabric: Seasons (Caused too much lag on server)\r\n- Removed Fabric: Seasons Extras (Caused too much lag on server)\r\n- Removed Fabric: Seasons Croptopia Compat (Caused too much lag on server)\r\n- Updated all mods\r\n\r\nChanges:\r\n- Over 200 new quests, with 4 new chapters covering 6 mods.\r\n- Added Wizards and Spellblade Quests contributed by Forg#9458 and ブネックス#3722\r\n- Added Botania Quests contributed by ブネックス#3722\r\n- Added Spectrum Quests contributed by ブネックス#3722\r\n- Added Powah Quests contributed by ブネックス#3722\r\n- Added Archon Quests contributed by ブネックス#3722\r\n- CameraOverhaul now comes disabled by default\r\n- Added damage limits to prevent one-shot exploits (Disabled for now)\r\n- Big balance changes in items and loot tables\r\n- Removed per-player difficulty scaling, that was making it impossible to play in servers with a large playerbase\r\n- Removed various items for balance reasons\r\n- Now Bad Omen can be removed by drinking milk"
  },
  "v1.6.1": {
    "changelog": "Prominence [FABRIC] v1.6.1\r\nThis small update brings some QoL changes and bug fixes.\r\nPLEASE REMOVE YOUR ARMOR PIECES IN THE COSMETIC SLOTS BEFORE UPDATE, OR ELSE YOU\u0027LL LOSE THEM! As Cosmetic Armor is being replaced with Vanity Slots, due to the issues it was causing.\r\n\r\nThis update also overrides the options file due to the crawl changes, you will lose your keybinds if you don\u0027t save them!\r\n\r\nMods:\r\n- Added You\u0027re In Grave Danger (By b1n_ry)\r\n- Added Vanity Slots (By Nyakorita)\r\n- Removed Easy Magic (Incompatibility with Zenith)\r\n- Removed Cosmetic Armor [FABRIC] (Caused too many issues and crashes)\r\n- Removed BLAST (Bypassed anti explosion flags)\r\n- Updated all mods\r\n\r\nChanges:\r\n- Added custom datapack to fix issues with missing items in recipes\r\n- Added custom datapack to add compatibility with all ores from the pack in indrev\u0027s ore card\r\n- Fixed lag involving REI, searches not working, etc\r\n- Disabled Charm\u0027s totem of preservation\r\n- Disabled Charm\u0027s inventory totem feature\r\n- Disabled Charm\u0027s inventory button\r\n- Blacklisted Powah machines in carryon\r\n- Made ALT as the default key for crawling\r\n- Blacklisted spell casting from 56 items to prevent incompatibilities"
  },
  "v1.7.0": {
    "changelog": "Prominence [FABRIC] 1.19.2 v1.7.0\r\nThis update fixes many issues, while also doing some important balance changes.\r\nMain balance changes are the nerf to full strength builds, as now it will only increase damage. Intelligence was also buffed to incentive players to try out going for healing builds in multiplayer. Almost all values were balance to balance out endgame builds.\r\n\r\nThere are also some highly requested QoL mod additions, like HT\u0027s TreeChop and FTB Ultimine.\r\n\r\nMods:\r\n- Added Ore Clumps (By CJMinecraft01)\r\n- Added Tiny Skeletons (By Fuzs)\r\n- Added Mindful Darkness [Forge \u0026 Fabric] (By Fuzs)\r\n- Added Clean Tooltips (By StalDev)\r\n- Added HT\u0027s TreeChop (By hammertater)\r\n- Added FTB Ultimine (Fabric) (By FTB)\r\n- Added Healing Bed (by noxgame1230)\r\n- Removed Smooth Swapping (Caused Issues)\r\n- Removed WOOF (Caused Issues)\r\n- Removed FPS Reducer (Caused Issues)\r\n- Removed Professions (Unused, Balance changes)\r\n- Removed Professions Integrations (Unused)\r\n- Removed Vein Mining (Replaced)\r\n- Updated all mods\r\n\r\nChanges:\r\n- Server performance inceased, ~20% less cpu usage.\r\n- Fixed issue with the questbook entering a loop when trying to close it\r\n- Fixed visual bug with continuity, blocks were overlapping themselves\r\n- Fixed crashes with AE2 machines\r\n- Fixed infinite \"Loading terrain\" screen that appeared to some people\r\n- Nerfed Constitution, Strength and Luckiness attributes.\r\n- Armor is now given by constitution instead of strength\r\n- Buffed Intelligence\u0027s healing amplification to incentive healing builds\r\n- The Twilight Forest now has stronger mobs.\r\n- Removed wrong button appearing in the game menu\r\n- Lost Souls now can be made by smelting Scoria\r\n- Disabled advanced tooltips from default options\r\n- General changes \u0026 fixes to menus"
  },
  "v1.8.0": {
    "changelog": "From now on, both Prominence 1.19.2 modpacks will be named \"Prominence I\", due to the release of 1.20 versions.\r\n\r\nThis update brings important balance changes, along with full support for VR headsets and 115 new quests.  A window will appear on launch that will make you choose VR or Non-VR mode. If you don\u0027t own a VR headset or don\u0027t want to use VR, you can simply launch it without VR and the game will run just fine. The mod still needs to be present so you can see VR users\u0027 interactions.\r\n\r\nKeep in mind that VR mode is experimental, and we suggest to not use render distances greater than 10 with it.\r\n\r\nChanges:\r\n- The modpack\u0027s name is now \"Prominence I\"\r\n- 115 new quests: Bewitchment \u0026 Soulslike chapters by vennexus \u0026 sideralismusic\r\n- Fabric Loader updated to 0.14.21\r\n- Added VR Support (Vivecraft)\r\n- Remade menus to work with VR users\r\n- Enchantment Descriptions are back\r\n- Nerfed some spellblade weapons\r\n- Added Spell Power Enchantments Config contributed by muon_r\r\n- Added Player Balance datapack by muon_r\r\n- Added some more items to spell engine\u0027s blacklist\r\n- Disabled Magic Bags (Duped items)\r\n- Nerfed spell power stats slightly to balance with other stat changes\r\n- Reorganized stats a bit to be more satisfying and rewarding for investing into a particular build without being overpowered\r\n- Relics are now way less common in chests and mob loot\r\n- Modified some VR options to give the best performance/quality ratio\r\n- Xaero\u0027s map now has the same colors as Prominence II\r\n- Fixed typo for tech reborn\u0027s quantum armor disabling. The armor should now be properly disabled\r\n\r\n- Fixed window icon being the forge one instead of fabric\u0027s\r\n\r\nMods:\r\n- Added Vivecraft (By Ferri_Arnus)\r\n- Removed Blur (Lag on low end machines, VR incompatibility)\r\n- Updated some mods"
  },
  "v2.2.0": {
    "changelog": "Prominence I [FABRIC] v2.2.0 | Stability Update\r\nThis update stabilizes the modpack further fixing many bugs and crashes. It also brings the new custom UI!\r\nThere\u0027s another update coming soon, v2.2.5, with a quest overhaul! Stay tuned:)\r\n\r\n## Changes:\r\n- Armor pieces now require plates to be made, upping their cost in materials.\r\n- Added tons of variants to vanilla blocks (Thanks Xanthian)\r\n- Many bugs were fixed from all the mod updates\r\n- Fixed crash when moving certain machines with carryon\r\n- Fixed a memory leak that crashed servers after ~30 hours of uptime\r\n- Fixed crash when interacting with create blocks\r\n- Fixed bugged backpack recipe\r\n- Removed Recipe Book (Increases performance)\r\n- Disabled biomepedia from the inventory\r\n\r\n## Mods:\r\n- Added Prominent UI\r\n- Added Better Chunk Loading\r\n- Added Shield Overhaul\r\n- Added Variant Shields\r\n- Added Variant Barrels\r\n- Added Variant Bookshelves\r\n- Added Variant Composters\r\n- Added Variant Lanterns\r\n- Added Variant Grindstones\r\n- Added Fabric Shield Lib\r\n- Removed Eldritch Mobs\r\n- Updated all mods"
  }
}